# More Data Preprocessing (with Pandas)

Pandas is a very useful data analytics package within Python.

Let's start with some random data.

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame(np.random.randn(5, 3), index=['a', 'c', 'e', 'f', 'h'], columns=['one', 'two', 'three'])
df

        one       two     three
a  0.754667 -0.135470  1.155980
c -1.476558  0.292011 -1.004071
e  0.211574 -1.927011 -0.097744
f  0.111375  1.265652 -1.579602
h  0.425659  0.889517  0.687079

We know with Pandas we can mix & match data types, so let us add two more columns, named 'four' and 'five':

In [3]:
df['four'] = 'bar'
df['five'] = df['one'] > 0
df

        one       two     three four   five
a  0.754667 -0.135470  1.155980  bar   True
c -1.476558  0.292011 -1.004071  bar  False
e  0.211574 -1.927011 -0.097744  bar   True
f  0.111375  1.265652 -1.579602  bar   True
h  0.425659  0.889517  0.687079  bar   True

Adding new rows is also simple. Below we include three extra empty rows:

In [4]:
df2 = df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])
df2

        one       two     three four   five
a  0.754667 -0.135470  1.155980  bar   True
b       NaN       NaN       NaN  NaN    NaN
c -1.476558  0.292011 -1.004071  bar  False
d       NaN       NaN       NaN  NaN    NaN
e  0.211574 -1.927011 -0.097744  bar   True
f  0.111375  1.265652 -1.579602  bar   True
g       NaN       NaN       NaN  NaN    NaN
h  0.425659  0.889517  0.687079  bar   True

# Your Turn Here

Do you still remember how to index a row/column?

In [27]:
#### index row 'c' below
df.loc['c']

one      -1.47656
two      0.292011
three    -1.00407
four          bar
five        False
Name: c, dtype: object

In [28]:
#### index column 'two' below
df.loc[:,'two']

a   -0.135470
c    0.292011
e   -1.927011
f    1.265652
h    0.889517
Name: two, dtype: float64

pandas has two functions isnull() and notnull() that return boolean objects when called.

In [29]:
pd.isnull(df2['one'])

a    False
b     True
c    False
d     True
e    False
f    False
g     True
h    False
Name: one, dtype: bool

In [30]:
pd.notnull(df2['one'])

a     True
b    False
c     True
d    False
e     True
f     True
g    False
h     True
Name: one, dtype: bool

Missing values propagate naturally through arithmetic operations between pandas objects.

In [31]:
a = df[['one','two']]
a['one']['a':'e'] = float('nan')
a

        one       two
a       NaN -0.135470
c       NaN  0.292011
e       NaN -1.927011
f  0.111375  1.265652
h  0.425659  0.889517

In [32]:
b = df[['one','two','three']]
b

        one       two     three
a  0.754667 -0.135470  1.155980
c -1.476558  0.292011 -1.004071
e  0.211574 -1.927011 -0.097744
f  0.111375  1.265652 -1.579602
h  0.425659  0.889517  0.687079

In [33]:
a + b

        one  three       two
a       NaN    NaN -0.270940
c       NaN    NaN  0.584022
e       NaN    NaN -3.854022
f  0.222750    NaN  2.531305
h  0.851317    NaN  1.779034

# How to deal with Missing Values

## Deleting Missing Values

The simplest method is always dropping all missing values - but it is highly **discouraged!!!**

In [34]:
a['one'].dropna()

f    0.111375
h    0.425659
Name: one, dtype: float64

By default, dropna() will drop any row containing **NaN** values, but you can change that by using the *axis=* and *thresh=* arguments.

**NOTE**: Dropping rows or columns have different uses.

In [35]:
#### This statement drop any column with NaN values
a.dropna(axis=1)

        two
a -0.135470
c  0.292011
e -1.927011
f  1.265652
h  0.889517

In [36]:
#### thresh determines how many non-NaN values a column/row should have without being dropped
c = a + b
c.dropna(axis=1, thresh=2)

        one       two
a       NaN -0.270940
c       NaN  0.584022
e       NaN -3.854022
f  0.222750  2.531305
h  0.851317  1.779034

You can also use the *how=* argument to determine how do you want to remove the NaN values.

In [37]:
#### By default, dropna() drops column/row with any NaN values
#### how = 'all' changes that to dropping column/row with all NaN values
c.dropna(axis=1, how='all')

        one       two
a       NaN -0.270940
c       NaN  0.584022
e       NaN -3.854022
f  0.222750  2.531305
h  0.851317  1.779034

You can refer to the [pandas.dropna() docs](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.dropna.html) for more information.

## Imputing Missing Values

Imputing means filling missing values - you can do that when the missing and non-missing values are in some type of relationship.

In [38]:
my_series = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
my_series

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [39]:
#### you can fill missing values with a specific value (0)
my_series.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

Alternatively, we can specify a forward-fill to propagate the previous value forward:

In [40]:
# forward-fill
my_series.fillna(method='ffill')

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

Or we can specify a back-fill to propagate the next values backward:

In [41]:
my_series.fillna(method='bfill')

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

## Your Turn Here
Aforementioned method can be applied to dataframes.

In [42]:
#### Let us generate a random dataframe
rand_df = pd.DataFrame(np.random.randn(5, 3), 
                  index=['a', 'b', 'c', 'd', 'e'],
                  columns=['one', 'two', 'three'])
rand_df = rand_df.mask(np.random.random(rand_df.shape) < .3)
rand_df

        one       two     three
a -0.561176  0.313857  1.258896
b -1.103598  0.257070       NaN
c -1.379314       NaN       NaN
d       NaN       NaN -0.693124
e  1.375533 -0.037698 -0.367472

Your tasks are as follows:

- fill missing values in column **one** with value 1;
- fill missing values in column **two** with forward-filling;
- fill missing values in column **three** with backward-filling.

In [43]:
#### insert your code here

A useful approach for imputing your missing data is to use mean/mode to replace missing data - the reason behind this logic is that if we are going to *guess* the values of the missing data, the highest chance would be guessing it to be the mean/mode if the data follows **normal** distribution.

In [44]:
#### let us generate another DF
my_df = pd.DataFrame(np.random.randn(5, 3), 
                  index=['a', 'b', 'c', 'd', 'e'],
                  columns=['A', 'B', 'C'])
my_df = my_df.mask(np.random.random(my_df.shape) < .3)
my_df

          A         B         C
a  0.313524       NaN  0.106515
b       NaN  0.948315  0.196143
c       NaN       NaN       NaN
d       NaN -0.562305 -1.069842
e  0.214698  0.196856  0.053577

In [45]:
#### Let us check if there is any missing value in the df
my_df.isnull().values.any()

True

In [46]:
#### Then we are getting the mean of the DF
#### Note that since we only 
my_df.mean()

A    0.264111
B    0.194289
C   -0.178402
dtype: float64

In [47]:
df_filled = my_df.fillna(my_df.mean())
df_filled

          A         B         C
a  0.313524  0.194289  0.106515
b  0.264111  0.948315  0.196143
c  0.264111  0.194289 -0.178402
d  0.264111 -0.562305 -1.069842
e  0.214698  0.196856  0.053577

In [48]:
#### Now let us check again if there is any missing values
df_filled.isnull().values.any()

False

More info regarding how to handle missing data can be found [here](https://machinelearningmastery.com/handle-missing-data-python/).

# Other Tasks in Data Preprocessing

- Handling categorical data (coding)
- Handling imbalanced data
- feature engineering

These topics will be covered in later part of this class.